In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Import CSV file for data text
df = pd.read_csv('walmart.csv', encoding='utf-8')

In [3]:
first_200_records = df.head(200)
print(first_200_records)

     User_ID Product_ID Gender    Age  Occupation City_Category  \
0    1000001  P00069042      F   0-17          10             A
1    1000001  P00248942      F   0-17          10             A
2    1000001  P00087842      F   0-17          10             A
3    1000001  P00085442      F   0-17          10             A
4    1000002  P00285442      M    55+          16             C
..       ...        ...    ...    ...         ...           ...
195  1000035  P00106742      M  46-50           1             C
196  1000036  P00102642      M  26-35           3             B
197  1000036  P00127442      M  26-35           3             B
198  1000036  P00345642      M  26-35           3             B
199  1000036  P00357842      M  26-35           3             B

    Stay_In_Current_City_Years  Marital_Status  Product_Category  Purchase
0                            2               0                 3      8370
1                            2               0                 1     15200
2                            2               0                12      1422
3                            2               0                12      1057
4                           4+               0                 8      7969
..                         ...             ...               ...       ...
195                         4+               1                 3     10767
196                          0               0                 4      2832
197                          0               0                 1      8066
198                          0               0                 1     15812
199                          0               0                 5      6967

[200 rows x 10 columns]

In [5]:
#Summary of info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 10 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category            550068 non-null  int64
 9   Purchase                    550068 non-null  int64
dtypes: int64(5), object(5)
memory usage: 42.0+ MB

In [6]:
# Check for Null Values in column
pd.isnull(df).sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category              0
Purchase                      0
dtype: int64

In [7]:
# Chceking duplicate values in column of interest
duplicates = df[df['Product_ID'].duplicated()]
print(duplicates)

        User_ID Product_ID Gender    Age  Occupation City_Category  \
121     1000023  P00313042      M  36-45           0             B
126     1000024  P00248942      F  26-35           7             A
136     1000026  P00346642      M  26-35           7             B
149     1000028  P00118742      F  26-35           1             C
159     1000031  P00117442      M    55+           7             C
...         ...        ...    ...    ...         ...           ...
550063  1006033  P00372445      M  51-55          13             B
550064  1006035  P00375436      F  26-35           1             C
550065  1006036  P00375436      F  26-35          15             B
550066  1006038  P00375436      F    55+           1             C
550067  1006039  P00371644      F  46-50           0             B

       Stay_In_Current_City_Years  Marital_Status  Product_Category  Purchase
121                             3               1                 5      5183
126                             3               1                 1     15774
136                             2               1                 8      7814
149                             2               1                 5      8690
159                             2               0                 5      8596
...                           ...             ...               ...       ...
550063                          1               1                20       368
550064                          3               0                20       371
550065                         4+               1                20       137
550066                          2               0                20       365
550067                         4+               1                20       490

[546437 rows x 10 columns]

In [8]:
# Count how many duplicate records are there:
duplicate_count = df['Product_ID'].duplicated().sum()
print(f'The number is: {duplicate_count}')

The number is: 546437

In [10]:
# Check for maximum value available in column 'purchase'
max_value = df['Purchase'].max()
print(f'Maximum value in Column: {max_value}')

Maximum value in Column: 23961

In [11]:
# Check for minimum value available in column 'purchase'
min_value = df['Purchase'].min()
print(f'The minimum value in column is: {min_value}')

The minimum value in column is: 12

In [16]:
# We will drop 'Gender', 'Age', 'Occupation', 'City_category', 'Stay_In_Current_City_Years' and 'Marital status' as our Model is not going to concentrate on those things
df_dropped = df.drop(columns=['Gender','Age','Occupation','City_Category','Stay_In_Current_City_Years','Marital_Status'])
print(df_dropped)
df_dropped.to_csv('/content/eda_part_1.csv', index=False)

        User_ID Product_ID  Product_Category  Purchase
0       1000001  P00069042                 3      8370
1       1000001  P00248942                 1     15200
2       1000001  P00087842                12      1422
3       1000001  P00085442                12      1057
4       1000002  P00285442                 8      7969
...         ...        ...               ...       ...
550063  1006033  P00372445                20       368
550064  1006035  P00375436                20       371
550065  1006036  P00375436                20       137
550066  1006038  P00375436                20       365
550067  1006039  P00371644                20       490

[550068 rows x 4 columns]